# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [23]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'abbas'
DB_PASSWORD = 'root'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://abbas:root@127.0.0.1:5432/pagila

'Connected: abbas@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [24]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://abbas:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [25]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [26]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2022, 1, 29, 5, 58, 52, 222594), Decimal('0.99')),
 (datetime.datetime(2022, 1, 25, 16, 14, 16, 895377), Decimal('2.99')),
 (datetime.datetime(2022, 1, 28, 4, 49, 49, 128218), Decimal('0.99')),
 (datetime.datetime(2022, 1, 31, 9, 58, 51, 176578), Decimal('2.99')),
 (datetime.datetime(2022, 1, 26, 20, 52, 41, 359433), Decimal('0.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [27]:
%sql DROP TABLE test_table

 * postgresql://abbas:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [28]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
186 rows affected.

[]

In [29]:
%sql SELECT * FROM dimDate LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
5 rows affected.

[(20220702, datetime.date(2022, 7, 2), 2022, 3, 7, 2, 26, True),
 (20220208, datetime.date(2022, 2, 8), 2022, 1, 2, 8, 6, False),
 (20220225, datetime.date(2022, 2, 25), 2022, 1, 2, 25, 8, False),
 (20220614, datetime.date(2022, 6, 14), 2022, 2, 6, 14, 24, False),
 (20220322, datetime.date(2022, 3, 22), 2022, 1, 3, 22, 12, False)]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [30]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT c.customer_id    AS c_key,
       c.customer_id    AS c_id,
       c.first_name     AS c_first_name,
       c.last_name      AS c_last_name,
       c.email          AS c_email,
       a.address        AS a_address,
       a.address2       AS a_address2,
       a.district       AS a_district,
       ci.city          AS ci_city, 
       co.country       AS co_country,
       a.postal_code    AS a_postal_code,
       a.phone          AS a_phone,
       c.active         AS c_active,
       c.create_date    AS c_create_date,
       now()            AS start_date,
       now()            AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://abbas:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [31]:
%sql SELECT * FROM dimCustomer LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2022, 9, 10), datetime.date(2022, 9, 10)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2022, 9, 10), datetime.date(2022, 9, 10)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2022, 9, 10), datetime.date(2022, 9, 10)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2022, 9, 10), datetime.date(2022, 9, 10)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2022, 9, 10), datetime.date(2022, 9, 10))]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [32]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, 
                     original_language, rental_duration, length, rating, special_features)
SELECT f.film_id                AS f_movie_key,
       f.film_id                AS f_film_id,
       f.title                  AS f_title,
       f.description            AS f_description,
       f.release_year           AS f_release_year,
       f.language_id            AS f_language_id,
       orig_lang.name           AS original_language,
       f.rental_duration        AS f_rental_duration,
       f.length                 AS f_length,
       f.rating                 AS f_rating,
       f.special_features       AS f_special_features
       
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://abbas:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [34]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code,
                    manager_first_name, manager_last_name, start_date, end_date)
SELECT  s.store_id       AS s_store_key,
        s.store_id       AS s_store_id,
        ad.address       AS ad_address,
        ad.address2      AS ad_address2,
        ad.district      AS ad_district,
        c.city           AS c_city,
        co.country       AS co_country,
        ad.postal_code   AS ad_postal_code,
        st.first_name    AS st_manager_first_name,
        st.last_name     AS st_manager_last_name,
        now()            AS start_date,
        now()            AS end_date

FROM store s
JOIN staff st       ON (s.manager_staff_id = st.staff_id)
JOIN address ad     ON (st.address_id = ad.address_id)
JOIN city c         ON (ad.city_id = c.city_id)
JOIN country co     ON (c.country_id = co.country_id);

 * postgresql://abbas:***@127.0.0.1:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [38]:
%%sql 
INSERT INTO factSales (sales_key, date_key, customer_key, movie_key, store_key, sales_amount)

SELECT  p.payment_id                                                        AS p_sales_key,
        TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer                  AS p_date_key,
        p.customer_id                                                       AS p_customer_key,
        i.film_id                                                           AS i_movie_key,
        i.store_id                                                          AS i_store_key,
        p.amount                                                            AS p_sales_amount

FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id);

 * postgresql://abbas:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

In [39]:
%sql SELECT * FROM dimMovie LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, '1', None, 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, '1', None, 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, '1', None, 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, '1', None, 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, '1', None, 6, 130, 'G', '{"Deleted Scenes"}')]

In [40]:
%sql SELECT * FROM dimStore LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, '23 Workhaven Lane', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2022, 9, 10), datetime.date(2022, 9, 10)),
 (2, 2, '1411 Lillydale Drive', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2022, 9, 10), datetime.date(2022, 9, 10))]

In [41]:
%sql SELECT * FROM factSales LIMIT 5;

 * postgresql://abbas:***@127.0.0.1:5432/pagila
5 rows affected.

[(16051, 20220129, 269, 651, 1, Decimal('0.99')),
 (16065, 20220125, 274, 138, 1, Decimal('2.99')),
 (16109, 20220128, 297, 186, 1, Decimal('0.99')),
 (16195, 20220131, 344, 197, 1, Decimal('2.99')),
 (16202, 20220126, 348, 741, 2, Decimal('0.99'))]